
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 8, 200, 200]              72
       BatchNorm2d-2          [-1, 8, 200, 200]              16
         MaxPool2d-3          [-1, 8, 100, 100]               0
            Conv2d-4         [-1, 16, 100, 100]           1,152
       BatchNorm2d-5         [-1, 16, 100, 100]              32
         MaxPool2d-6           [-1, 16, 50, 50]               0
            Conv2d-7           [-1, 32, 25, 25]           4,608
       BatchNorm2d-8           [-1, 32, 25, 25]              64
              Mish-9           [-1, 32, 25, 25]               0
           Conv2d-10           [-1, 32, 25, 25]           9,216
      BatchNorm2d-11           [-1, 32, 25, 25]              64
           Conv2d-12           [-1, 32, 25, 25]             512
      BatchNorm2d-13           [-1, 32, 25, 25]              64
             Mish-14           [-1, 32, 25, 25]               0
        ConvBlock-15           [-1, 32, 25, 25]               0
           Conv2d-16           [-1, 64, 13, 13]          18,432
      BatchNorm2d-17           [-1, 64, 13, 13]             128
             Mish-18           [-1, 64, 13, 13]               0
           Conv2d-19           [-1, 64, 13, 13]          36,864
      BatchNorm2d-20           [-1, 64, 13, 13]             128
           Conv2d-21           [-1, 64, 13, 13]           2,048
      BatchNorm2d-22           [-1, 64, 13, 13]             128
             Mish-23           [-1, 64, 13, 13]               0
        ConvBlock-24           [-1, 64, 13, 13]               0
           Conv2d-25            [-1, 128, 7, 7]          73,728
      BatchNorm2d-26            [-1, 128, 7, 7]             256
             Mish-27            [-1, 128, 7, 7]               0
           Conv2d-28            [-1, 128, 7, 7]         147,456
      BatchNorm2d-29            [-1, 128, 7, 7]             256
           Conv2d-30            [-1, 128, 7, 7]           8,192
      BatchNorm2d-31            [-1, 128, 7, 7]             256
             Mish-32            [-1, 128, 7, 7]               0
        ConvBlock-33            [-1, 128, 7, 7]               0
           Conv2d-34            [-1, 256, 4, 4]         294,912
      BatchNorm2d-35            [-1, 256, 4, 4]             512
             Mish-36            [-1, 256, 4, 4]               0
           Conv2d-37            [-1, 256, 4, 4]         589,824
      BatchNorm2d-38            [-1, 256, 4, 4]             512
           Conv2d-39            [-1, 256, 4, 4]          32,768
      BatchNorm2d-40            [-1, 256, 4, 4]             512
             Mish-41            [-1, 256, 4, 4]               0
        ConvBlock-42            [-1, 256, 4, 4]               0
           Conv2d-43            [-1, 256, 4, 4]          65,792
           Conv2d-44            [-1, 256, 7, 7]          33,024
           Conv2d-45          [-1, 256, 13, 13]          16,640
           Conv2d-46          [-1, 256, 25, 25]           8,448
           Conv2d-47          [-1, 256, 25, 25]         590,080
AdaptiveAvgPool2d-48            [-1, 256, 1, 1]               0
AdaptiveAvgPool2d-49            [-1, 256, 1, 1]               0
          Flatten-50                  [-1, 256]               0
           Linear-51                    [-1, 1]             257
          Flatten-52                  [-1, 256]               0
           Linear-53                    [-1, 5]           1,285
================================================================
Total params: 1,938,238
Trainable params: 1,938,238
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.15
Forward/backward pass size (MB): 13.97
Params size (MB): 7.39
Estimated Total Size (MB): 21.52
----------------------------------------------------------------